Copy code
<template>
 <div class="flex flex-col justify-center items-center gap-8 mx-20">
  <div ref="container" class="keen-slider w-full">
    <div v-for="(chunk, index) in chunkedComments" :key="index" class="keen-slider__slide flex flex-col justify-center items-center overflow-hidden w-[328px] sm:w-full h-auto">
      <div class="comments-container flex flex-col justify-center gap-4 w-[328px] sm:w-full">
        <div v-for="(comment, idx) in chunk" :key="idx" class="comment flex flex-col w-full justify-center gap-8 p-6 rounded-xl items-start bg-Bg/3">
          <div class="flex justify-start items-center gap-4">
            <img :src="comment.img" class="w-[58px] object-cover">
            <div class="flex flex-col justify-center items-start gap-1">
              <h5 class="text-[20px] leading-[140%] font-bold">{{ comment.employer }}</h5>
              <p class="text-[16px] leading-[160%] text-txt2">{{ comment.loc }}</p>
            </div>
          </div>

          <div class="text-right">
            <p class="text-[14px] leading-[160%] text-txt2 font-thin">{{ comment.comment }}</p>
          </div>
        </div>
      </div>
    </div>  
  </div>
 </div>
</template>

<script>
import { ref, computed } from 'vue';
import { useKeenSlider } from 'keen-slider/vue';

export default {
  setup() {
    const comments = ref([
      {comment : 'من از لحظه ای که کار سئو رو به شما دادم،با اطمینان تمام طی این دوسال تمام روند رودر سریعترین حالت ممکن طی کردید ،همیشه رتبه یک بودیم و تعهد ومسئولیت بالای شما ،نظم ودقت بالاتون برای من قابل تحسین بود. اینکه وقتی یک چالش پیش می اومد همگام با من دنبال ارائه راه حل وحل موضوع بودید وسر سری موضوع رو رد نمیکردیم واسم مهم بود. اینکه با افرادی در حوزه کارتون در ارتباط هستین که در سریعترین حالت خدمات مورد نظرم ون رو برای سایت اوکی میکنن خودش خیلی مهمه ودر وقت صرفه جویی میشه. حسی که دارم با آدم منصف ،خوش اخلاق وبا تجربه ودر مسیر پیشرفته دارم کار میکنم.' , employer : 'خانم بینایی ' , loc : 'مدیر سایت لبخند شاپ ' , img : '/img/9.png'},
      {comment : 'من از لحظه ای که کار سئو رو به شما دادم،با اطمینان تمام طی این دوسال تمام روند رودر سریعترین حالت ممکن طی کردید ،همیشه رتبه یک بودیم و تعهد ومسئولیت بالای شما ،نظم ودقت بالاتون برای من قابل تحسین بود. اینکه وقتی یک چالش پیش می اومد همگام با من دنبال ارائه راه حل وحل موضوع بودید وسر سری موضوع رو رد نمیکردیم واسم مهم بود. اینکه با افرادی در حوزه کارتون در ارتباط هستین که در سریعترین حالت خدمات مورد نظرم ون رو برای سایت اوکی میکنن خودش خیلی مهمه ودر وقت صرفه جویی میشه. حسی که دارم با آدم منصف ،خوش اخلاق وبا تجربه ودر مسیر پیشرفته دارم کار میکنم.' , employer : 'خانم بینایی2 ' , loc : 'مدیر سایت لبخند شاپ ', img : '/img/9.png'},
      {comment : 'من از لحظه ای که کار سئو رو به شما دادم،با اطمینان تمام طی این دوسال تمام روند رودر سریعترین حالت ممکن طی کردید ،همیشه رتبه یک بودیم و تعهد ومسئولیت بالای شما ،نظم ودقت بالاتون برای من قابل تحسین بود. اینکه وقتی یک چالش پیش می اومد همگام با من دنبال ارائه راه حل وحل موضوع بودید وسر سری موضوع رو رد نمیکردیم واسم مهم بود. اینکه با افرادی در حوزه کارتون در ارتباط هستین که در سریعترین حالت خدمات مورد نظرم ون رو برای سایت اوکی میکنن خودش خیلی مهمه ودر وقت صرفه جویی میشه. حسی که دارم با آدم منصف ،خوش اخلاق وبا تجربه ودر مسیر پیشرفته دارم کار میکنم.' , employer : '3خانم بینایی ' , loc : 'مدیر سایت لبخند شاپ ', img : '/img/9.png'},
      {comment : 'من از لحظه ای که کار سئو رو به شما دادم،با اطمینان تمام طی این دوسال تمام روند رودر سریعترین حالت ممکن طی کردید ،همیشه رتبه یک بودیم و تعهد ومسئولیت بالای شما ،نظم ودقت بالاتون برای من قابل تحسین بود. اینکه وقتی یک چالش پیش می اومد همگام با من دنبال ارائه راه حل وحل موضوع بودید وسر سری موضوع رو رد نمیکردیم واسم مهم بود. اینکه با افرادی در حوزه کارتون در ارتباط هستین که در سریعترین حالت خدمات مورد نظرم ون رو برای سایت اوکی میکنن خودش خیلی مهمه ودر وقت صرفه جویی میشه. حسی که دارم با آدم منصف ،خوش اخلاق وبا تجربه ودر مسیر پیشرفته دارم کار میکنم.' , employer : '4خانم بینایی ' , loc : 'مدیر سایت لبخند شاپ ', img : '/img/9.png'},
      {comment : 'من از لحظه ای که کار سئو رو به شما دادم،با اطمینان تمام طی این دوسال تمام روند رودر سریعترین حالت ممکن طی کردید ،همیشه رتبه یک بودیم و تعهد ومسئولیت بالای شما ،نظم ودقت بالاتون برای من قابل تحسین بود. اینکه وقتی یک چالش پیش می اومد همگام با من دنبال ارائه راه حل وحل موضوع بودید وسر سری موضوع رو رد نمیکردیم واسم مهم بود. اینکه با افرادی در حوزه کارتون در ارتباط هستین که در سریعترین حالت خدمات مورد نظرم ون رو برای سایت اوکی میکنن خودش خیلی مهمه ودر وقت صرفه جویی میشه. حسی که دارم با آدم منصف ،خوش اخلاق وبا تجربه ودر مسیر پیشرفته دارم کار میکنم.' , employer : '5خانم بینایی ' , loc : 'مدیر سایت لبخند شاپ ', img : '/img/9.png'},
      {comment : 'من از لحظه ای که کار سئو رو به شما دادم،با اطمینان تمام طی این دوسال تمام روند رودر سریعترین حالت ممکن طی کردید ،همیشه رتبه یک بودیم و تعهد ومسئولیت بالای شما ،نظم ودقت بالاتون برای من قابل تحسین بود. اینکه وقتی یک چالش پیش می اومد همگام با من دنبال ارائه راه حل وحل موضوع بودید وسر سری موضوع رو رد نمیکردیم واسم مهم بود. اینکه با افرادی در حوزه کارتون در ارتباط هستین که در سریعترین حالت خدمات مورد نظرم ون رو برای سایت اوکی میکنن خودش خیلی مهمه ودر وقت صرفه جویی میشه. حسی که دارم با آدم منصف ،خوش اخلاق وبا تجربه ودر مسیر پیشرفته دارم کار میکنم.' , employer : '6خانم بینایی ' , loc : 'مدیر سایت لبخند شاپ ', img : '/img/9.png'},
      {comment : 'من از لحظه ای که کار سئو رو به شما دادم،با اطمینان تمام طی این دوسال تمام روند رودر سریعترین حالت ممکن طی کردید ،همیشه رتبه یک بودیم و تعهد ومسئولیت بالای شما ،نظم ودقت بالاتون برای من قابل تحسین بود. اینکه وقتی یک چالش پیش می اومد همگام با من دنبال ارائه راه حل وحل موضوع بودید وسر سری موضوع رو رد نمیکردیم واسم مهم بود. اینکه با افرادی در حوزه کارتون در ارتباط هستین که در سریعترین حالت خدمات مورد نظرم ون رو برای سایت اوکی میکنن خودش خیلی مهمه ودر وقت صرفه جویی میشه. حسی که دارم با آدم منصف ،خوش اخلاق وبا تجربه ودر مسیر پیشرفته دارم کار میکنم.' , employer : '7خانم بینایی ' , loc : 'مدیر سایت لبخند شاپ ', img : '/img/9.png'},
    ]);

    const currentSlide = ref(0);

    // تقسیم کامنت‌ها به گروه‌های دو تایی
    const chunkedComments = computed(() => {
      const chunkSize = 2;
      const chunks = [];
      for (let i = 0; i < comments.value.length; i += chunkSize) {
        chunks.push(comments.value.slice(i, i + chunkSize));
      }
      return chunks;
    });

    const [container, slider] = useKeenSlider({
      loop: false,
      slides: {
        perView: 1,
        spacing: 10,
        origin : window.innerWidth < 768 ? 0.38 : 1.55
      },
      slideChanged(s) {
        currentSlide.value = s.details().relativeSlide; // به روز رسانی وضعیت اسلاید فعلی
      },
    });

    return { container, chunkedComments,currentSlide};
  },
};
</script>

<style scoped>
.keen-slider {
  display: flex;
  justify-content: center; /* مرکز کردن اسلایدها */
  align-items: start; /* مرکز کردن عمودی */
  height: 100%;
}
@media screen and (max-width : 768px) {
  .keen-slider__slide {
  min-width: unset !important;
  width: 310px !important;
}
}
.pagination {
  display: flex;
  justify-content: center; /* مرکز کردن دکمه‌ها */
  margin-top: 20px; /* فاصله بالای دکمه‌ها */
}

.dot {
  width: 12px; /* عرض دکمه */
  height: 12px; /* ارتفاع دکمه */
  border-radius: 50%; /* گرد کردن دکمه */
  background-color: #ccc; /* رنگ پس‌زمینه عادی */
  margin: 0 5px; /* فاصله بین دکمه‌ها */
  border: none; /* حذف حاشیه */
  cursor: pointer; /* نشانگر ماوس به شکل اشاره‌گر */
  transition: background-color 0.3s; /* انیمیشن تغییر رنگ */
}

.dot.active {
  background-color: #007bff; /* رنگ پس‌زمینه فعال */
}
</style>